#+TITLE: My Dev Log
#+date: 2024-05-21 11:58  
#+STARTUP: content
#+STARTUP: latexpreview
#+OPTIONS: broken-links:t
#+OPTIONS: toc:3
#+OPTIONS: num:0
#+EXPORT_FILE_NAME: index.html

* About 

Source Repo ->

log to track my dev journey

#+begin_src python :results output :exports both :session
print("hello word")
#+end_src

#+RESULTS:
: hello word

* 2024
** 2024-06 June
:PROPERTIES:
:ID:       DEDBD5FD-A0E6-425B-AB28-D526CEBDCFB7
:END:
*** 2024-06-20 Thursday

**** 09:26 PM - Log:
:LOGBOOK:
CLOCK: [2024-06-20 Thu 21:26]--[2024-06-20 Thu 21:31] =>  0:05
:END:

https://www.mikesteder.com/engineering/management/gifs/software/illustrated/2014/12/31/software-engineering-illustrated-im-just-trying-to-change-this-lightbulb.html
- Good read about technical debt. Revisiting this and still things relatable (now even more).

*** 2024-06-22 Saturday

**** 10:01 PM - Log:
:LOGBOOK:
CLOCK: [2024-06-22 Sat 22:01]--[2024-06-22 Sat 22:05] =>  0:04
:END:

Was thinking about writing my own editor. Why you ask?
- A fun and challenging project to work on

I could write it down in python with help of blogs and videos. But i also want to learn new language so maybe i can try in rust.

Found this good blogs on writing your or TUI based editor in C.
- https://viewsourcecode.org/snaptoken/kilo/index.html
And of course everything that is in C has a version in rust.
- https://www.flenker.blog/hecto/ [this is what i am planning to follow]

Both seem to be great work.

*** 2024-06-24 Monday

**** 05:11 PM - Log:
:LOGBOOK:
CLOCK: [2024-06-24 Mon 17:11]--[2024-06-24 Mon 17:12] =>  0:01
:END:

***** you can only cook what's in the fridge // reasons to read

- https://www.youtube.com/watch?v=S0krJtb8vxI

Book reco from above
- 1984 by George Orwell: https://www.thriftbooks.com/w/ninetee...
- Cycling Home From Siberia: https://www.thriftbooks.com/w/cycling...
- Wind, Sand, and Stars by Antoine de St. Exupery: https://www.thriftbooks.com/w/wind-sa...
- Flight to Arras by Antoine de St. Exupery: https://www.thriftbooks.com/w/pilote-...
- The Little Prince by Antoine de St. Exupery: https://www.thriftbooks.com/w/the-lit...
- The Complete Tales of Winnie the Pooh by A.A. Milne: https://www.thriftbooks.com/w/the-com...

These links are to new copies:

- Steal Like An Artist by Austin Kleon: https://austinkleon.com/steal/
- Keep Going by Austin Kleon: https://austinkleon.com/keepgoing/
- Show Your Work by Austin Kleon: https://austinkleon.com/show-your-work/

*** 2024-06-26 Wednesday

**** 11:03 AM - Log:
:LOGBOOK:
CLOCK: [2024-06-26 Wed 11:03]--[2024-06-26 Wed 11:04] =>  0:01
:END:

Running gunicorn to support ~n~ workers and ~y~ thread, and Why?
- Increasing the server's throughput
- https://stackoverflow.com/questions/38425620/gunicorn-workers-and-threads

